# $ Classification Exercises $

### imports

In [1]:
import pandas as pd
import env
from pydataset import data
import acquire

# 4.  Create a pandas dataframe, df_iris, from this data.

In [ ]:
# use pydataset to import iris data and create data frame
df = data('iris')

# show top 3 rows of iris data
df.head(3)

In [ ]:
# use attribute shape of dataframe to obtain number of rows and columns
df.shape

In [ ]:
# use attribute columns to obtain column names
df.columns

In [ ]:
# Return a nice list of columns if I want to grab and use them later.

df.columns.to_list()

In [ ]:
# use attribute dtypes to see data types of columns
df.dtypes

In [ ]:
# Return data types plus.

df.info()

In [ ]:
# use describe method to see useful statistics of data transpose
df.describe().T

# 5. Read the data from this google sheet into a dataframe, df_google.

In [ ]:
# save url to variable
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
# replace edit with export and save to variable
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [ ]:
# read url created csv and create data frame
google_df = pd.read_csv(csv_export_url)

# show top 3 rows fo data frame
google_df.head(3)

In [ ]:
# use attribute shape of dataframe to obtain number of rows and columns
google_df.shape

In [ ]:
# use attribute columns to obtain column names in a list
google_df.columns.to_list()

In [ ]:
# use method .info() to see more information such as nulls
google_df.info()

In [ ]:
# use attribute dtypes to see data types of columns
google_df.dtypes

In [ ]:
# use describe method to see useful statistics of numeric variables
google_df.describe().T

In [ ]:
# use nunique method to print how many unique values are in categorical variables
google_df.select_dtypes('object').nunique()

In [ ]:
# I could get a count of unique values for each variable with an object data type.

for col in google_df.columns:
#     print(col)
    if google_df[col].dtypes == 'object':
        print(f'{col} has {google_df[col].nunique()} unique values.')

In [ ]:
google_df.Survived.value_counts(dropna=False)

In [ ]:
google_df.Pclass.value_counts(dropna=False)

In [ ]:
google_df.Sex.value_counts(dropna=False)

In [ ]:
google_df.Embarked.value_counts(dropna=False)

# 6. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [ ]:
# create data frame from excel file
df_excel = pd.read_excel('df_excel.xlsx')
df_excel_sample = pd.read_excel('df_excel.xlsx').head(100)

In [ ]:
# look at info
df_excel.info()

In [ ]:
# shape of df
df_excel_sample.shape

In [ ]:
# return the number of rows only using attribute
df_excel.shape[0]

In [ ]:
# print the first 5 column names using attribute [:5] (inclusive) of data frame
df_excel_sample.columns[:5]

In [ ]:
# returns a list: print of column names that have a data type of object
df_excel_sample.select_dtypes(object).columns.tolist()

In [ ]:
# returns an array : print of column names that have a data type of object
df_excel_sample.select_dtypes(object).columns

In [ ]:
# use select dtypes and see the head
df_excel.select_dtypes(include='object').head()

In [ ]:
# Not seperating encoded columns compute the range of numeric variables in data frame
df_excel_sample.select_dtypes('float64').max()-df_excel_sample.select_dtypes('float64').min()

In [ ]:
# Some of these numeric columms are more like encoded categorical variables.

df_excel.head(3)

In [ ]:
# The two columns I want to know the range on are 'Age' and 'Fare'
# I can select just the true numeric variables to declutter my results.

titanic_stats = df_excel[['Age', 'Fare']].describe().T
titanic_stats

# acquire.py TEST Functions

In [2]:
telco_df = acquire.get_telco_data()
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [3]:
iris_df = acquire.get_iris_data()
iris_df.head()

,Unnamed: 0,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,1,2,4.9,3.0,1.4,0.2,setosa
2,2,1,3,4.7,3.2,1.3,0.2,setosa
3,3,1,4,4.6,3.1,1.5,0.2,setosa
4,4,1,5,5.0,3.6,1.4,0.2,setosa

In [4]:
titanic_df = acquire.get_titanic_data()
titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

# acquire.py code in file
```python

import os
import pandas as pd

import env


def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'


def get_titanic_data():
    filename = "titanic.csv"

    # if file is available locally, read it
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    
    # if file not available locally, acquire data from SQL database
    # and write it as csv locally for future use
    else:
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)

        # Return the dataframe to the calling code
        return df  

    


def get_iris_data():
    filename = "iris.csv"

    # if file is available locally, read it
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    
    # if file not available locally, acquire data from SQL database
    # and write it as csv locally for future use
    else:
        df = pd.read_sql('SELECT * FROM measurements JOIN species USING(species_id);', get_connection('iris_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)

        # Return the dataframe to the calling code
        return df 


def new_telco_data():
    '''
    This function reads the telco data from the Codeup db into a df.
    '''
    sql_query = """
                select * from customers
                join contract_types using (contract_type_id)
                join internet_service_types using (internet_service_type_id)
                join payment_types using (payment_type_id)
                """
    
    # Read in DataFrame from Codeup db.
    df = pd.read_sql(sql_query, get_connection('telco_churn'))
    
    return df
def get_telco_data():
    '''
    This function reads in telco data from Codeup database, writes data to
    a csv file if a local file does not exist, and returns a df.
    '''
    if os.path.isfile('telco.csv'):
        
        # If csv file exists read in data from csv file.
        df = pd.read_csv('telco.csv', index_col=0)
        
    else:
        
        # Read fresh data from db into a DataFrame
        df = new_telco_data()
        
        # Cache data
        df.to_csv('telco.csv')
        
    return df
```